; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=186, out_folder=htg/blocksworld/training, instance_id=22, seed=2046, goal_proportion=0.03

(define (problem blocksworld-22)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 - object)
 (:init 
    (arm-empty)
    (clear b39)
    (on-table b39)
    (clear b71)
    (on b71 b31)
    (on-table b31)
    (clear b115)
    (on b115 b160)
    (on b160 b145)
    (on b145 b100)
    (on-table b100)
    (clear b6)
    (on b6 b133)
    (on-table b133)
    (clear b5)
    (on b5 b102)
    (on b102 b44)
    (on b44 b13)
    (on b13 b79)
    (on b79 b122)
    (on-table b122)
    (clear b87)
    (on b87 b76)
    (on b76 b24)
    (on-table b24)
    (clear b125)
    (on-table b125)
    (clear b41)
    (on-table b41)
    (clear b66)
    (on b66 b106)
    (on b106 b38)
    (on b38 b185)
    (on b185 b82)
    (on b82 b153)
    (on b153 b86)
    (on-table b86)
    (clear b68)
    (on b68 b61)
    (on b61 b60)
    (on-table b60)
    (clear b35)
    (on b35 b49)
    (on b49 b171)
    (on b171 b40)
    (on-table b40)
    (clear b75)
    (on b75 b16)
    (on-table b16)
    (clear b154)
    (on b154 b34)
    (on b34 b166)
    (on b166 b23)
    (on b23 b50)
    (on b50 b151)
    (on b151 b110)
    (on b110 b67)
    (on b67 b88)
    (on b88 b91)
    (on-table b91)
    (clear b148)
    (on-table b148)
    (clear b103)
    (on b103 b14)
    (on b14 b130)
    (on-table b130)
    (clear b163)
    (on b163 b109)
    (on b109 b59)
    (on-table b59)
    (clear b98)
    (on b98 b33)
    (on b33 b55)
    (on b55 b146)
    (on b146 b56)
    (on b56 b73)
    (on b73 b149)
    (on b149 b167)
    (on b167 b179)
    (on b179 b42)
    (on b42 b112)
    (on-table b112)
    (clear b150)
    (on b150 b147)
    (on b147 b119)
    (on-table b119)
    (clear b18)
    (on b18 b36)
    (on-table b36)
    (clear b43)
    (on-table b43)
    (clear b182)
    (on b182 b89)
    (on b89 b63)
    (on-table b63)
    (clear b162)
    (on b162 b175)
    (on b175 b170)
    (on b170 b117)
    (on b117 b177)
    (on b177 b169)
    (on-table b169)
    (clear b114)
    (on b114 b93)
    (on b93 b186)
    (on b186 b108)
    (on-table b108)
    (clear b21)
    (on b21 b72)
    (on b72 b99)
    (on-table b99)
    (clear b54)
    (on b54 b168)
    (on b168 b9)
    (on b9 b141)
    (on b141 b28)
    (on b28 b7)
    (on-table b7)
    (clear b165)
    (on b165 b126)
    (on b126 b95)
    (on b95 b83)
    (on b83 b69)
    (on-table b69)
    (clear b157)
    (on b157 b90)
    (on b90 b129)
    (on b129 b131)
    (on b131 b158)
    (on b158 b4)
    (on b4 b178)
    (on b178 b19)
    (on b19 b123)
    (on b123 b156)
    (on-table b156)
    (clear b2)
    (on b2 b65)
    (on b65 b116)
    (on b116 b52)
    (on b52 b11)
    (on b11 b29)
    (on b29 b27)
    (on b27 b47)
    (on-table b47)
    (clear b181)
    (on b181 b184)
    (on b184 b92)
    (on b92 b10)
    (on b10 b113)
    (on b113 b159)
    (on b159 b37)
    (on b37 b48)
    (on-table b48)
    (clear b80)
    (on b80 b62)
    (on b62 b132)
    (on-table b132)
    (clear b135)
    (on b135 b74)
    (on b74 b94)
    (on b94 b20)
    (on b20 b173)
    (on b173 b142)
    (on-table b142)
    (clear b176)
    (on-table b176)
    (clear b96)
    (on-table b96)
    (clear b139)
    (on-table b139)
    (clear b58)
    (on b58 b144)
    (on b144 b121)
    (on-table b121)
    (clear b53)
    (on b53 b174)
    (on b174 b111)
    (on-table b111)
    (clear b26)
    (on b26 b137)
    (on b137 b124)
    (on b124 b107)
    (on-table b107)
    (clear b128)
    (on-table b128)
    (clear b15)
    (on-table b15)
    (clear b22)
    (on b22 b155)
    (on b155 b12)
    (on b12 b57)
    (on b57 b118)
    (on-table b118)
    (clear b30)
    (on b30 b152)
    (on b152 b140)
    (on b140 b180)
    (on-table b180)
    (clear b25)
    (on b25 b172)
    (on-table b172)
    (clear b64)
    (on b64 b17)
    (on b17 b97)
    (on-table b97)
    (clear b1)
    (on b1 b134)
    (on b134 b81)
    (on-table b81)
    (clear b183)
    (on b183 b138)
    (on b138 b136)
    (on b136 b101)
    (on b101 b8)
    (on b8 b46)
    (on b46 b77)
    (on b77 b3)
    (on-table b3)
    (clear b84)
    (on b84 b120)
    (on b120 b161)
    (on b161 b70)
    (on b70 b45)
    (on b45 b127)
    (on b127 b32)
    (on-table b32)
    (clear b51)
    (on b51 b78)
    (on-table b78)
    (clear b105)
    (on b105 b85)
    (on-table b85)
    (clear b164)
    (on b164 b104)
    (on b104 b143)
    (on-table b143))
 (:goal  (and 
    (clear b2)
    (on b2 b3)
    (on b3 b4)
    (on-table b4)
    (clear b5)
    (on b5 b1)
    (on-table b1))))

; plan
1. (unstack b1 b134)
   deleted: (on b1 b134) (clear b1) (arm-empty)
   added: (holding b1) (clear b134)
   goals met: 2 of 7
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 7
3. (unstack b157 b90)
   deleted: (on b157 b90) (clear b157) (arm-empty)
   added: (holding b157) (clear b90)
   goals met: 3 of 7
4. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 3 of 7
5. (unstack b183 b138)
   deleted: (on b183 b138) (clear b183) (arm-empty)
   added: (holding b183) (clear b138)
   goals met: 3 of 7
6. (putdown b183)
   deleted: (holding b183)
   added: (clear b183) (arm-empty) (on-table b183)
   goals met: 3 of 7
7. (unstack b138 b136)
   deleted: (on b138 b136) (clear b138) (arm-empty)
   added: (holding b138) (clear b136)
   goals met: 3 of 7
8. (putdown b138)
   deleted: (holding b138)
   added: (clear b138) (arm-empty) (on-table b138)
   goals met: 3 of 7
9. (unstack b136 b101)
   deleted: (on b136 b101) (clear b136) (arm-empty)
   added: (holding b136) (clear b101)
   goals met: 3 of 7
10. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 3 of 7
11. (unstack b101 b8)
   deleted: (on b101 b8) (clear b101) (arm-empty)
   added: (holding b101) (clear b8)
   goals met: 3 of 7
12. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 3 of 7
13. (unstack b8 b46)
   deleted: (on b8 b46) (clear b8) (arm-empty)
   added: (holding b8) (clear b46)
   goals met: 3 of 7
14. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 7
15. (unstack b46 b77)
   deleted: (on b46 b77) (clear b46) (arm-empty)
   added: (holding b46) (clear b77)
   goals met: 3 of 7
16. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 3 of 7
17. (unstack b77 b3)
   deleted: (on b77 b3) (clear b77) (arm-empty)
   added: (holding b77) (clear b3)
   goals met: 3 of 7
18. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 3 of 7
19. (unstack b90 b129)
   deleted: (on b90 b129) (clear b90) (arm-empty)
   added: (holding b90) (clear b129)
   goals met: 3 of 7
20. (putdown b90)
   deleted: (holding b90)
   added: (clear b90) (arm-empty) (on-table b90)
   goals met: 3 of 7
21. (unstack b129 b131)
   deleted: (on b129 b131) (clear b129) (arm-empty)
   added: (holding b129) (clear b131)
   goals met: 3 of 7
22. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 3 of 7
23. (unstack b131 b158)
   deleted: (on b131 b158) (clear b131) (arm-empty)
   added: (holding b131) (clear b158)
   goals met: 3 of 7
24. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 3 of 7
25. (unstack b158 b4)
   deleted: (on b158 b4) (clear b158) (arm-empty)
   added: (holding b158) (clear b4)
   goals met: 3 of 7
26. (putdown b158)
   deleted: (holding b158)
   added: (clear b158) (arm-empty) (on-table b158)
   goals met: 3 of 7
27. (unstack b4 b178)
   deleted: (on b4 b178) (clear b4) (arm-empty)
   added: (holding b4) (clear b178)
   goals met: 3 of 7
28. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 7
29. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 4 of 7
30. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 5 of 7
31. (unstack b2 b65)
   deleted: (on b2 b65) (clear b2) (arm-empty)
   added: (holding b2) (clear b65)
   goals met: 4 of 7
32. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 6 of 7
33. (unstack b5 b102)
   deleted: (on b5 b102) (clear b5) (arm-empty)
   added: (holding b5) (clear b102)
   goals met: 5 of 7
34. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 7 of 7
